GetValidTypes Method (Document, ICollection(ElementId))
 Obtains a set of types that are valid for all given elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static ICollection<ElementId> GetValidTypes(
	Document document,
	ICollection<ElementId> elementIds
)
Visual Basic
Public Shared Function GetValidTypes ( _
	document As Document, _
	elementIds As ICollection(Of ElementId) _
) As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ GetValidTypes(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
Parameters
document
Type: Autodesk.Revit.DBDocument
 The document.
elementIds
Type: System.Collections.GenericICollectionElementId
 A collection of element IDs.
Return Value
 A set of element IDs of types that are valid for these elements or an empty set if any element cannot have a type assigned.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  Thrown when at least one of the elements does not exist in the document.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
GetValidTypes Overload
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →